@edwardmedia 

Specifically I encountered weird behavior on the output of google_project "id"

The docs on https://registry.terraform.io/providers/hashicorp/google/latest/docs/resources/google_project#attributes-reference mention the following available Attributes Reference:

```
    id - an identifier for the resource with format projects/{{project}}
    number - The numeric identifier of the project.
```

However, there is an ondocumented attribute reference, namely "project_id".
The different between "id" and "project_id" seems to be that "id" returns the id of the project in the format `projects/{{project}}`

Whereas "project_id" seems to only return the id in the format `{{project}}`

I encountered this behavior while trying to create a google_service_account in a specific project. As the input for the project of google_service_account I used the output of google_project "id", which caused a 404.

Example that will generate an error due to the usage of "id":

```tf
resource "google_project" "my_project" {
  name       = "A test project"
  project_id = "test-project-09350"
  org_id     = "1234567"
  billing_account = "1234567"
}

resource "google_service_account" "service_account" {
  account_id   = "service-account-id"
  display_name = "Service Account"
  project = google_project.my_project.id
}
```

Working example due to the ondocumented existance of "project_id" as an output of the resource "google_project":

```tf
resource "google_project" "my_project" {
  name       = "A test project"
  project_id = "test-project-09350"
  org_id     = "1234567"
}

resource "google_service_account" "service_account" {
  account_id   = "awesome-service-account-id"
  display_name = "A awesome Service Account"
  project = google_project.my_project.project_id
}
```

To recap. output of a non-working run due to usage of `google_project.my_project.id`:

```tf
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project.my_project will be created
  + resource "google_project" "my_project" {
      + auto_create_network = true
      + billing_account     = "<CENSORED>"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "A test project"
      + number              = (known after apply)
      + org_id              = "<CENSORED>"
      + project_id          = "test-project-09350"
      + skip_delete         = (known after apply)
    }

  # google_service_account.service_account will be created
  + resource "google_service_account" "service_account" {
      + account_id   = "tst-serviceaccount-21590125"
      + display_name = "Service Account 21590125"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_project.my_project: Creating...
google_project.my_project: Still creating... [10s elapsed]
google_project.my_project: Still creating... [20s elapsed]
google_project.my_project: Still creating... [30s elapsed]
google_project.my_project: Creation complete after 33s [id=projects/test-project-09350]
google_service_account.service_account: Creating...
╷
│ Error: Error creating service account: googleapi: got HTTP response code 404 with body: <!DOCTYPE html>
│ <html lang=en>
│   <meta charset=utf-8>
│   <meta name=viewport content="initial-scale=1, minimum-scale=1, width=device-width">
│   <title>Error 404 (Not Found)!!1</title>
│   <style>
│     *{margin:0;padding:0}html,code{font:15px/22px arial,sans-serif}html{background:#fff;color:#222;padding:15px}body{margin:7% auto 0;max-width:390px;min-height:180px;padding:30px 0 15px}* > body{background:url(//www.google.com/images/errors/robot.png) 100% 5px no-repeat;padding-right:205px}p{margin:11px 0 22px;overflow:hidden}ins{color:#777;text-decoration:none}a img{border:0}@media screen and (max-width:772px){body{background:none;margin-top:0;max-width:none;padding-right:0}}#logo{background:url(//www.google.com/images/branding/googlelogo/1x/googlelogo_color_150x54dp.png) no-repeat;margin-left:-5px}@media only screen and (min-resolution:192dpi){#logo{background:url(//www.google.com/images/branding/googlelogo/2x/googlelogo_color_150x54dp.png) no-repeat 0% 0%/100% 100%;-moz-border-image:url(//www.google.com/images/branding/googlelogo/2x/googlelogo_color_150x54dp.png) 0}}@media only screen and (-webkit-min-device-pixel-ratio:2){#logo{background:url(//www.google.com/images/branding/googlelogo/2x/googlelogo_color_150x54dp.png) no-repeat;-webkit-background-size:100% 100%}}#logo{display:inline-block;height:54px;width:150px}
│   </style>
│   <a href=//www.google.com/><span id=logo aria-label=Google></span></a>
│   <p><b>404.</b> <ins>That’s an error.</ins>
│   <p>The requested URL <code>/v1/projects/projects/test-project-09350/serviceAccounts?alt=json&amp;prettyPrint=false</code> was not found on this server.  <ins>That’s all we know.</ins>
│
│
│   with google_service_account.service_account,
│   on serviceaccounts.tf line 1, in resource "google_service_account" "service_account":
│    1: resource "google_service_account" "service_account" {
│
╵
```

And now a working run that uses `google_project.my_project.project_id`, used a fresh project name: as well (because at first I thought the error was just due to the propagation time, but that was not the case)

```tf

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project.my_project will be created
  + resource "google_project" "my_project" {
      + auto_create_network = true
      + billing_account     = "<censored>"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "A new test project"
      + number              = (known after apply)
      + org_id              = "<censored>"
      + project_id          = "test-project-93483"
      + skip_delete         = (known after apply)
    }

  # google_service_account.service_account will be created
  + resource "google_service_account" "service_account" {
      + account_id   = "tst-serviceaccount-21590125"
      + display_name = "Service Account 21590125"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "test-project-93483"
      + unique_id    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_project.my_project: Creating...
google_project.my_project: Still creating... [10s elapsed]
google_project.my_project: Still creating... [20s elapsed]
google_project.my_project: Creation complete after 27s [id=projects/test-project-93483]
google_service_account.service_account: Creating...
google_service_account.service_account: Still creating... [10s elapsed]
google_service_account.service_account: Still creating... [20s elapsed]
google_service_account.service_account: Creation complete after 29s [id=projects/test-project-93483/serviceAccounts/tst-serviceaccount-21590125@test-project-93483.iam.gserviceaccount.com]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```

My main suggestion would be to also add "project_id" to the documents and add a warning on the behavior ("id" formatting versus "project_id" formatting).

But this could also point to a bug on the behavior of "id" for the resource google_project or even a bug to the behavior of the resource "google_service_account" for the argument "project".

I could argue that google_service_account potentially checks if the project given begins with projects/ and if so, filters that. But I'm not sure what the normal behavior is in that regard.

Hope this clarified a lot of things, apologies if my initial report was unclear.